# zsh
brew 'zsh'
brew 'zsh-syntax-highlighting'

# vim
brew 'vim'

brew 'gitlint'

# direnv
brew 'direnv'

# tags
brew 'universal-ctags'

# gpg
brew 'gpg'

# git
brew 'git'

# GitHub
brew 'gh'

# ruby
brew 'chruby'
brew 'ruby-install'

# node
brew 'node'

# yarn
brew 'yarn'

# php
#brew 'composer'

# javascript

# db
#brew 'sqlite'
#brew 'postgresql'

# redis
#brew 'redis'

# terraform
#brew 'terraform'

# Rigprep
brew 'ripgrep'

# fuzzy find
brew 'fzf'

# apps
tap 'homebrew/cask-versions'

cask '1Password'
cask 'bitwarden'
cask 'docker'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
cask 'postico'
cask 'slack'
cask 'gitify'

# fonts
cask 'font-ia-writer-mono'
