# zsh
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'

# shell tools
brew 'tmux'
brew 'htop'

# gpg
brew 'gpg'

# git
brew 'git'

# ruby
brew 'chruby'
brew 'ruby-install'

# php
brew 'composer'

# javascript
brew 'yarn'
brew 'node'

# db
brew 'sqlite'
brew 'postgresql'

# redis
brew 'redis'

# terraform
brew 'terraform'
tap 'wata727/tflint'
brew 'tflint'

# cloud foundary
tap 'cloudfoundry/tap'
brew 'cf-cli'

# heroku
tap 'heroku/brew'
brew 'heroku'

# casks
tap 'homebrew/cask-versions'

cask '1Password'
cask 'bitwarden'
cask 'docker'
cask 'figma'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
cask 'postico'
cask 'sequel-pro'
cask 'slack'
cask 'keybase'
cask 'sublime-text'
cask 'visual-studio-code'
