# zsh
brew 'zsh'
brew 'zsh-syntax-highlighting'

# vim
brew 'vim'

# direnv
brew 'direnv'

# tags
brew 'universal-tags'

# gpg
brew 'gpg'

# git
brew 'git'

# GitHub
brew 'gh'

# ruby
brew 'chruby'
brew 'ruby-install'

# node
# https://github.com/tkareine/chnode
brew tap tkareine/chnode
brew install tkareine/chnode/chnode
brew install node-build

# php
brew 'composer'

# javascript
brew 'yarn'
brew 'node'

# db
brew 'sqlite'
brew 'postgresql'

# redis
brew 'redis'

# terraform
brew 'terraform'
tap 'wata727/tflint'
brew 'tflint'

# cloud foundary
tap 'cloudfoundry/tap'
brew 'cf-cli'

# heroku
tap 'heroku/brew'
brew 'heroku'

# silver searcher
brew 'ag'

# fuzzy find
brew 'fzf'

# casks
tap 'homebrew/cask-versions'

cask '1Password'
cask 'bitwarden'
cask 'docker'
cask 'figma'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
cask 'postico'
cask 'sequel-pro'
cask 'slack'
cask 'keybase'
cask 'transmit'
